"use client";

import React from "react";
import Accordion from "../components/shared/Accordion";

const Questions = [
  {
    title: "ماهي منصة مشروك ؟",
    children:
      `منصة عقارية مرخصة تتيح عرض المنتجات العقارية القابلة لشراكة بنظام التملك الحر أو المشاع ، كما تمكن المطورين العقاريين المعتمدين أو المالكين من المشاركة في تطوير المنتجات العقارية بآليات احترافية ومنظومة موثوقة. 
منصة مشروك توفر سوقا عقاريا من خلاله يستطيع العميل البحث عما يناسبه بطريقة سهلة ومرنة كما تقدم له خيار تقديم طلب شراء حسب قدرته الشرائية.
مزايا مشروك:
توفير فرص عقارية جديدة وبسعر مناسب للجميع
خلق فرص بيعية جديدة وتطوير للمنتجات العقارية
مناسبة لجميع الفئات لتيسير العملية البيعية
وسيلة لتملك العقار بكل يسر وسهولة
تشجيع الملاك والوسطاء والمطورين لتوفير منتجات مناسب
فكرة مميزة وأصبحت واقع`,
  },
  {
    title: "ماهي القيمة السوقية اللي يضيفها مشروك للعميل؟",
    children:
      "توفير حل للعميل في تملك العقار بطريقة التشارك وبقيمة تنافسية وخلق فرص تجارية للملاك والمطورين",
  },
  {
    title: "كيف أعرف بأن العقار المعروض في مشروك موثوق أو لا؟",
    children:
      "لا يعرض المنتج العقاري بالسوق بالمنصة حتى يطابق معلوماته بالخرائط المكانية من ناحية المساحة والواجهات ومرتبط بأيقونة الهيئة العامة للعقار",
  },
  {
    title: "ما هي وسائل الدفع المتاحة؟",
    children: "التحويل البنكي أو الدفع بالموقع أو الشيك المصدق فقط.",
  },
  {
    title:
      "هل بإمكاني استرداد الرسوم إذا بيع العقار أو تغيرت رغبتي أو اهتمامي بعد انضمامي كشريك أو تأخر الشريك الأخر أو لم تكتمل نسبة الشراكة؟",
    children:
      "تسترد الرسوم في ثلاث حالات كالتالي: إذا تراجع البائع أو تعذر وجود شريك آخر أو أنسحب الشريك الآخر",
  },
  {
    title: "تمت الموافقة من الشركاء على شراء العقار ما هو الإجراء؟",
    children:
      "التواصل مع الأطراف لتنسيق ومن ثم طلب تسليم السعي ومن ثم التنسيق مع الموثق لعملية الإفراغ",
  },
  {
    title:
      "هل بالإمكان الدفع نقدًا سواء رسوم أو سعي عند الرغبة بالانضمام كشريك؟",
    children: "لا يقبل الدفع نقدا والمنصة ومنسوبيها غير مسؤولين عن ذلك",
  },
  {
    title: "كم تستغرق عملية الإفراغ؟",
    children:
      "عند تواجد أطراف الصفقة (البائع والمشتري أو من ينوب عنهما بالوكالة) يتم الإفراغ الفوري",
  },
  {
    title: "هل المنصة تقدم خدمات أخرى ما بعد البيع؟",
    children:
      "خدمات تجهيز محاضر الدمج والتجزئة والتصاميم الهندسية والإشراف والمقاول وخدمات أخرى باختيار العميل للجهات المتوفرة بالمنصة للقيام بالمهمة ويكون التعاقد معهم مباشرة ",
  },
  {
    title: "في حالة التطوير من هو الطرف الثالث لعملية ضبط التعاقد؟",
    children:
      "محامي معتمد أو إذا كانت هناك منصات حكومية متوفرة لعمل ذلك برغبة الأطراف",
  },
  {
    title: "ما المستندات المطلوبة لشراء أو تطوير عقار؟",
    children: "صك الملكية – رخصة البناء- شهادة الاشغال",
  },
  {
    title: "من المسؤول عن توافر المخططات والضمانات وسلامة العقار المبني؟",
    children: "مالك العقار سواء كان فردا أو مطور عقاري",
  },
  {
    title:
      "كمطور عقاري أو مالك هل يحق لي اختيار محامي من طرفي أم المنصة هي من تختار؟",
    children: "نعم وبشرط موافقة الطرف الشريك",
  },
  {
    title: "هل هناك اتفاقيات خارج المنصة بين الأطراف؟",
    children:
      "لا يلزم المنصة أي اتفاقيات خارج مهامها وتكون مسوليه أطراف الصفقة ",
  },
];

const QuestionsData: React.FC = () => {
  return (
    <div className="p-4">
      {Questions.map((question, index) => (
        <Accordion key={index} title={question.title}>
          <p>{question.children}</p>
        </Accordion>
      ))}
    </div>
  );
};

export default QuestionsData;
