"use client"
import { BackButtonOutline } from "@/app/assets/svg";
import { useRouter } from "next/navigation";
const AboutPage=()=>{
    let router = useRouter();
    const handleBack = (e: React.MouseEvent<HTMLButtonElement>) => {
        e.preventDefault();
        router.push(`/`);
      };
    return (
      <div className="p-3">
        <div style={{ direction: "rtl" }}>
          <div className="flex items-center justify-center">
            <div>
              <button onClick={handleBack}>
                <BackButtonOutline />
              </button>
            </div>
            <div className="flex flex-1  items-center justify-center">
              <p className="flex items-center justify-center text-[#36343B] font-bold text-xl">
              سياسة حقوق الملكية الفكرية
              </p>
            </div>
          </div>
        </div>
        <hr className="h-px my-4 bg-gray-300 border-0 dark:bg-gray-700 " />
        <div className="p-2 text-md">
        
          <h3 className="font-bold text-md my-3">
          التعاريف
          </h3>
          <ul className="list-disc list-inside space-y-2">
        <li><strong>الغير أو الكيان:</strong> يشير القصد الى الأفراد أو الشركات أو المؤسسات بمختلف الأنشطة سواء كانت حكومية أو أهلية.</li>
        <li><strong>نحن أو لنا:</strong> يشير القصد لمنصة مشروك وكل ما يرتبط بهما في الاستخدام سواء باللغة العربية أو الإنجليزية.</li>
        <li><strong>الطرف الأول:</strong> مالك الحقوق الفكرية.</li>
        <li><strong>الطرف الثاني:</strong> من حصل على تلك الحقوق من صاحب الحقوق الفكرية الأصل أو في طور المفاوضات.</li>
        <li><strong>الطرف الثالث:</strong> فرد أو كيان لا يملك حق الإعلانات العقارية ولكنه يمكنه الاطلاع على المعروض بالمنصة.</li>
      </ul>
      <section className="mb-4">
      <h3 className="text-md font-semibold my-2">محتوى المنصة</h3>
      <p className="mb-2">
        هي النصوص أو الأرقام أو المعلومات أو البيانات أو الرسائل العامة أو السرية الموجهة لنا أو الصور التي تعيد المنصة معالجتها أو توليدها بأي شكل من الأشكال على خوادمها دون التعارض مع حق نشر الإعلانات العقارية الأصلية المنسوبة لأصحابها من المعلنين لدينا. حيث أن الإعلان ينسب لصاحبه أما محتواه المعالج لدينا فهو حق لنا ويمكن استخدامه بأي شكل من الأشكال، على سبيل المثال وليس الحصر، يمكن تحليله أو إعادة معالجته بنظم الذكاء الاصطناعي أو استخدامه لكتابة التقارير أو بيعها أو بيع نتائجه أو نتائج عدة محتويات مجمعة أو نشرها دون الإضرار بصاحب الإعلان بأي شكل من الأشكال أو نسب حقوقه لنا.
      </p>
    </section>
    <section className="my-4">
      <h2 className="text-md font-semibold mb-2">تعريف سياسة حقوق الملكية الفكرية</h2>
      <p className="mb-2">
        حقوق الملكية الفكرية تعرف بكونها مصطلح عام أُجد لحماية ما ينسب من حقوق لأصحابها أو ملاكها من أفراد أو شركات أو مؤسسات خاصة كانت أو حكومية. على سبيل المثال وليس الحصر، براءة الاختراع أو حقوق النشر أو العلامات التجارية. يمكن اعتبار حقوق الملكية الفكرية حق قانوني مستحدث لحفظ، على سبيل المثال وليس الحصر، الابتكارات أو المؤلفات أو المقالات أو الصور في كافة المجالات كالأدبية أو العلمية أو الصناعية أو الصناعية، أو الإعلانات لعقارات مملوكة أو حاصل صاحبها على تفويض عقاري حصري أو حقوق نشر غير حصرية.
      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">سياسة حقوق الملكية الفكرية</h2>
      <p className="mb-2">
        تتبع هذه السياسة شروط وضوابط واللوائح المطبقة في المملكة العربية السعودية المتعلقة بحقوق الملكية الفكرية بدون أي تعارض معها. كما أنها لا تتعارض أيضًا مع أي اتفاقيات عالمية قامت المملكة العربية السعودية بالانضمام لها أو الاتفاق مع مضمونها. تمنع سياسة حقوق الملكية الفكرية لدينا من سرقة أو انتهاك أي علامة تجارية (عالمية أو محلية) أو اسم تجاري أو انتحال شخصية ذات شهرة شخصية أو إعلانات مملوكة أو مفوض لها بشكل حصري أو غير حصري.
      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">حقوق منصة مشروك</h2>
      <p className="mb-2">
        اسم منصة مشروك وشعارها منسوبان لهذه المنصة ولا نسمح باستخدامهما مطلقًا أو نسبهما لأي جهة أخرى أو فرد أو مؤسسة أو شركة من دون العودة لنا وأخذ الإذن منا. كما أن استخدامهما يعد انتحال لهوية المنصة.
      </p>
    </section>
    <section className="">
      <h2 className="text-md font-semibold mb-2">ملاحظة</h2>
      <p className="mb-2">
        يحق لنا الزيادة أو التعديل أو الحذف على هذه اللائحة في أي وقت أو زمان من دون الرجوع للزوار أو الأعضاء أو أي شخص أو مؤسسة أو شركة تستخدم هذه المنصة.
      </p>
    </section>
        </div>
        </div>
    )
}
export default AboutPage