"use client"
import { BackButtonOutline } from "@/app/assets/svg";
import { useRouter } from "next/navigation";
const AboutPage=()=>{
    let router = useRouter();
    const handleBack = (e: React.MouseEvent<HTMLButtonElement>) => {
        e.preventDefault();
        router.push(`/`);
      };
    return (
      <div className="p-3">
        <div style={{ direction: "rtl" }}>
          <div className="flex items-center justify-center">
            <div>
              <button onClick={handleBack}>
                <BackButtonOutline />
              </button>
            </div>
            <div className="flex flex-1  items-center justify-center">
              <p className="flex items-center justify-center text-[#36343B] font-bold text-xl">
                سياسة الخصوصية
              </p>
            </div>
          </div>
        </div>
        <hr className="h-px my-4 bg-gray-300 border-0 dark:bg-gray-700 " />
        <div className="p-2 text-md">
          <p >
            تسعدنا زيارتكم  لمنصة مشروك
            ، ونفيدكم بأن منصة مشروك ملتزمة بشكل كامل بسياسة الخصوصية هذه. ويشمل ذلك، احترام خصوصية المستخدمين والتأكد من اتخاذنا جميع التدابير المتاحة لحماية معلومات وبيانات المستخدمين بما في ذلك بياناتهم الشخصية وفقًا للأنظمة المعمول بها في المملكة العربية السعودية.
          </p>
          <h3 className="font-bold text-md my-3">
            كيف نجمع البيانات ونستخدمها؟
          </h3>
          <p>
            نحن نقوم بجمع بياناتك عندما ترسل إلينا استفسارًا حول عروضنا أو عند زيارة موقعنا الإلكتروني أو حينما تبدي اهتمامك من خلال:
          </p>
          <ol className="list-decimal ms-5">

            <li>نحن نقوم بجمع بياناتك عندما ترسل إلينا استفسارًا حول عروضنا أو عند زيارة موقعنا الإلكتروني أو حينما تبدي اهتمامك من خلال:</li>
            <li>المشاركة في إحدى فعالياتنا أو زيارة أجنحتنا</li>
            <li>	عند زيارة أحد مكاتب مبيعاتنا أو الاتصال بمستشاري المبيعات</li>
          </ol>
          <p>
            نقوم بمعالجة البيانات أو جمعها أو استخدامها فقط حسبما تقتضيه الضرورة لضمان توفير أفضل الخدمات الممكنة للمستخدمين. على سبيل المثال، قد تتطلب بعض خدماتنا أن تقوم بالتسجيل وإنشاء حساب أو تقديم بياناتك الشخصية. وفي مثل هذه الأحوال، قد نطلب منك بعض البيانات مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك.
          </p>
          <h3 className="font-bold text-md my-3">
          ما هي المعلومات التي نقوم بجمعها؟
          </h3>
          <p>تتضمن المعلومات التي قد نجمعها (والتي قد يتم جمعها تلقائيًا في بعض الأحوال) ما يلي:
الاسم رخصة فال وعنوان البريد الإلكتروني ورقم الجوال والموقع الجغرافي وتفاصيل التمويل وعنوان بروتوكول الإنترنت (IP) ومعلومات الجهاز ونوع المتصفح ولغته وتاريخ ووقت طلبك ورابط الإحالة (URL) وملفات تعريف الارتباط التي قد تحدد على نحو دقيق المتصفح الذي تستخدمه أو أيًا من حساباتك على منصاتنا وتفاصيل استفسارك، وذلك وفقًا لما تقتضيه مصالحنا التجارية المشروعة.
</p>
<h3 className="font-bold text-md my-3">
لماذا نجمع معلوماتك؟
          </h3>
          <p>
          نقوم بمعالجة البيانات وجمعها واستخدامها فقط حسبما تقتضيه الضرورة وبصورة معقولة لضمان توفير أفضل الخدمات لمستخدمي موقعنا. وتشمل الأغراض التي نجمع البيانات من أجلها، على سبيل المثال لا الحصر، ما يلي:
          </p>
          <ol className="list-decimal ms-5">

<li>الرد على أي استفسارات أو إبداء اهتمام من قبلكم </li>
<li>طلب ملاحظاتك والرد على الشكاوى</li>
<li>توقيع أو إبرام أي نوع من العقود والاتفاقيات</li>
<li>تزويدك بمعلومات مخصصة لاحتياجاتك حول الخدمات وأحدث العروض التي نقدمها</li>
<li>تحسين خدمة الإعلانات</li>
<li>	تلبية أي طلبات لخدمات ما بعد البيع</li>
<li>الوفاء بالتزاماتنا بموجب الأنظمة واللوائح السعودية (‘النظام المعمول بها’)</li>
<li>إبلاغك بالتغييرات التي تطرأ على أحد أنظمتنا الأساسية أو جميعها</li>

</ol>
<h3 className="font-bold text-md my-3">
لمن يجوز لنا الكشف عن معلوماتك الشخصية؟
          </h3>
          <p>
          قد نكشف عن بياناتك وفق ما يقتضية النظام المعمول به للهيئات الحكومية وجهات تطبيق النظام الجهات الأخرى التي تملك صلاحية طلب مثل تلك المعلومات. يجوز لنا أيضًا الكشف عن بياناتك لأي طرف إلى الحد المسموح به بموجب النظام المعمول به. هذا ويمكنك اختيار عدم تقديم بعض المعلومات الشخصية التي نطلبها، ولن يؤثر هذا بشكل عام على قدرتك على الوصول إلى منصاتنا والاستفادة منها. ومع ذلك، قد لا تتمكن من الوصول إلى بعض وظائف منصاتنا أو بعض الخدمات التي نقدمها. وعلاوة على ذلك، قد نعقد شراكات مع أطراف أخرى من أجل: مساعدتنا في عرض الإعلانات ذات الصلة وإدارتها عبر قنوات متعددة، بما في ذلك منصات وسائل التواصل الاجتماعي وإجراء أنشطة التدقيق والمراجعة وقياس جودة البيانات وضمان رضا العملاء وتحسين تجربتهم ومشاركتها مع مركز الاتصال بشكل يومي. وبالمثل، قد نشارك معلوماتك مع جهات التمويل من أجل تمويل العملاء عند الطلب. كما قد يستخدم شركاؤنا الخارجيون ملفات تعريف الارتباط والتقنيات غير القائمة على ملفات تعريف الارتباط لمساعدتنا في عرض إعلاناتنا لك بناءً على أنشطة التصفح التي تقوم بها واهتماماتك بشكل يومي. كذلك، قد نشارك بياناتك مع جهات حكومية أخرى وفقًا لما يقتضيه النظام.
          </p>
          <h3 className="font-bold text-md my-3">
          إلى متى نحتفظ بمعلوماتك؟
          </h3>
          <p>
          سوف نحتفظ فقط بمعلوماتك الشخصية طالما كان ذلك ضروريًا على نحو معقول أو مسموحًا به نظامًا أو مطلوبًا بموجب النظام المعمول به. 
ملفات تعريف الارتباط وتقنيات التتبع
في بعض الحالات، قد نجمع أيضًا بياناتك من خلال استخدام ملفات تعريف الارتباط. ويشير مصطلح ‘ملف تعريف الارتباط’ إلى نص قصير يتم تحميله وتخزينه على القرص الصلب للمستخدم والمصمم بشكل أساسي لتحسين الخدمات التي نقدمها. لن يتم تخزين ملفات تعريف الارتباط على المتصفح الذي تستخدمه دون إذنك، كما أن ملفات تعريف الارتباط لا تشغل سوى مساحة ضئيلة من القرص الصلب. قد نرسل ملف تعريف ارتباط إلى جهازك عندما تحاول الدخول إلى منصاتنا. وهناك أشكال أخرى من تقنيات التتبع قد نستخدمها بالإضافة إلى ملفات تعريف الارتباط، مثل علامات البيكسل. وتتيح لنا ملفات تعريف الارتباط وغيرها من تقنيات التتبع، التعرف على جهازك وتخصيص تجربة التصفح على الإنترنت. كما تساعدنا على تعقب الخدمات التي تطلع عليها حتى نتمكن من إرسال الأخبار حول هذه الخدمات إليك. كذلك، فإننا نستخدم ملفات تعريف الارتباط لقياس أنماط المرور بالموقع وتحديد الأقسام التي قمت بزيارتها في موقعنا، وقياس أنماط المعاملات في نماذج مجمعة. إننا نستخدم هذه القياسات للبحث والتعرف على عادات المستخدمين عن قرب بحيث نتمكن من تحسين الخدمات التي نقدمها مع ضمان حماية بيانات المستخدمين على النحو الأفضل. إذا كنت لا ترغب في تلقي ملفات تعريف الارتباط، يمكنك ضبط المتصفح الذي تستخدمه بحيث لا يقبلها جهازك.

          </p>
          <h3 className="font-bold text-md my-3">
          الموافقة
          </h3>
          <p>
          باستخدام منصاتنا، فإنك توافق على الالتزام ببنود سياسة الخصوصية هذه واستخدامنا لبياناتك بالطريقة الموضحة في هذه السياسة.
          </p>
          <h3 className="font-bold text-md my-3">
          كيف تتواصل معنا؟
          </h3>
         <p>
         في حالة وجود أي استفسارات متعلقة بهذه السياسة، يمكنك التواصل معنا من خلال إحدى الطرق التالية:
البريد الإلكتروني: info@mashrook.saر
رقم خدمة العملاء: ---------

         </p>
         <h3 className="font-bold text-md my-3">
         إخلاء المسئولية
          </h3>
         <p>
         تخلي مؤسسة مشروك العقارية مسئوليتها في حال كانت المعلومات المتاحة على منصاتنا غير دقيقة أو كاملة أو حديثة. فقد تم توفير المعلومات لأغراض المعرفة العامة فقط. وأي اعتماد من جانبك على تلك المعلومات يقع على مسؤوليتك الخاصة. كما إنك توافق على تحمل المسئولية عن متابعة التغييرات على منصاتنا.
         </p>
        </div>
        </div>
    )
}
export default AboutPage