"use client"
import { BackButtonOutline } from "@/app/assets/svg";
import { useRouter } from "next/navigation";
const AboutPage=()=>{
    let router = useRouter();
    const handleBack = (e: React.MouseEvent<HTMLButtonElement>) => {
        e.preventDefault();
        router.push(`/`);
      };
    return (
      <div className="p-3">
        <div style={{ direction: "rtl" }}>
          <div className="flex items-center justify-center">
            <div>
              <button onClick={handleBack}>
                <BackButtonOutline />
              </button>
            </div>
            <div className="flex flex-1  items-center justify-center">
              <p className="flex items-center justify-center text-[#36343B] font-bold text-xl">
                شروط والاحكام
              </p>
            </div>
          </div>
        </div>
        <hr className="h-px my-4 bg-gray-300 border-0 dark:bg-gray-700 " />
        <div className="p-2 text-md">
        <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">أحكام وشروط الاستخدام لمنصة مشروك العقارية</h2>
      <p>قبول شروط الخدمة:</p>
      <p className="mb-2">
        يسري هذا الاتفاق بين كل من (مالك – أو مطور – أو وكيل – أو وسيط – أو مستفيد) موقع منصة مشروك. إن استعمالك لموقع منصة مشروك يعني موافقتك على شروط الخدمة المبينة أدناه. 
        فباستخدامك لموقع مشروك تقر بأنك قرأت شروط الخدمة وبأنك وافقت عليها. إذا كنت لا توافق على هذه الشروط الخاصة بالاستعمال، لا يسمح لك بدخول أو استخدام موقع منصة مشروك.
      </p>

      <h3 className="text-md font-semibold mb-2">شروط الخدمة:</h3>
      <p className="mb-2">
        تتمتع منصة مشروك بكامل الصلاحية في حق التغيير أو التبديل أو الزيادة أو النقصان في أي جزء من هذا الاتفاق، كاملاً أو جزئياً، وفي أي وقت كان، ويصبح أي تعديل في هذا الاتفاق ساري المفعول مباشرة.
      </p>

      <h3 className="text-md font-semibold mb-2">إخلاء المسئولية:</h3>
      <p className="mb-2">
      سياسة الاستخدام


احكام وشروط الاستخدام لمنصة مشروك العقارية
قبول شروط الخدمة:
يسري هذا الاتفاق بين كل من (مالك – أو مطور – أو وكيل – أو وسيط – أو مستفيد) موقع منصة مشروك  
إن استعمالك لموقع منصة مشروك  يعني موافقتك على شروط الخدمة المبينة أدناه. فباستخدامك لموقع مشروك تقر بأنك قرأت شروط الخدمة وبأنك وافقت عليها. إذا كنت لا توافق على هذه الشروط الخاصة بالاستعمال لا يسمح لك بدخول أو استخدام موقع منصة مشروك  .
شروط الخدمة:
تتمتع منصة مشروك  بكامل الصلاحية في حق التغيير أو التبديل أو الزيادة أو النقصان في أي جزء من هذا الاتفاق، كاملاً أو جزئياً، وفي أي وقت كان، ويصبح أي تعديل في هذا الاتفاق ساري المفعول مباشرة.
إخلاء المسئولية:
تلتزم منصة مشروك بأن كل ما يتوفر به من محتويات وأنظمة معلوماتية ووظائف ومواد ومعلومات مقدمة على الموقع، معروضة “كما هي” حسب أقصى ما يسمح به القانون. ولا تقدم منصة مشروك ولا أي من توابعه أو فروعه أي تمثيل أو ضمانات كيفما كانت لها صلة بمحتوى منصة مشروك  أو أي من المواد والمعلومات والوظائف القابلة للاستعمال بواسطة الأنظمة المعلوماتية المتوفرة على منصة مشروك ولا تتحمل منصة مشروك أية مسؤولية إزاء أي من المنتوجات أو الخدمات أو الروابط الإلكترونية المتصلة بأطراف أخرى ثالثة، كما لا يتحمل مسئولية أي انتهاك للأمان المرتبط بإرسال معلومات حساسة من خلال مشروك أو أي رابط من روابطه. وفوق ذلك، لا تمنح منصة مشروك أية ضمانات واضحة كانت أو مضمنة، تتعلق، دون استثناء، بعدم القابلية للانتهاك أو سلامة شروط المتاجرة أو الصلاحية المتعلقة بأي أمر من الأمور. ولا تضمن منصة مشروك بأن بيانات الطلبات العقارية ومزودي الخدمات العقارية والإعلانات العقارية وبيانات الوحدات العقارية الموجودة على موقعه أي من مواده أو محتوياته خالية من الأخطاء. كما لا تضمن منصة مشروك بأن مثل تلك الأخطاء ستصحح، أو بأن منصة مشروك أو النظام المعلوماتي الذي يعمل من خلاله سيكون خاليا من الفيروسات أو أي شيء ضار. ولن تكون مشروك أو أي من توابعه أو فروعه، مسؤول عن استعمال منصة مشروك بما في ذلك وبدون استثناء، المحتوى أو أي خطأ من الأخطاء المتواجدة به.
البيانات:
كل البيانات التي قام المستخدم بإضافتها في الموقع متاحة للاستخدام الشخصي والخاص والتجاري للمستخدم، وتشمل على سبيل المثال لا الحصر، بيانات الطلب العقاري وبيانات الوحدات العقارية المعروضة، وبيانات مزودي الخدمات العقارية المسجلين في الموقع، وبيانات الإعلانات العقارية المروجة، والبيانات المرسلة عبر المحادثات الداخلية أو عبر قنوات الاتصال الأخرى التي تتحيها منصة مشروك.
استخدام محتوى الموقع :
يمكنك تحميل، عرض، وطباعة نسخة من أي محتوى منصة مشروك  سواء لأغراضك الشخصية أو التجارية التي يسعى منصة مشروك تحقيقها لك، ويخضع هذا الاستخدام للقوانين والقيود المنصوص عليها في هذا الاتفاقية، ونؤكد بأن الاسم، الشعار، وكل المحتويات التي تظهر على موقع وتطبيق منصة مشروك ، سوف تظل ملكاً خاصاً لمنصة مشروك .باستثناء ما هو مسموح به صراحة في هذا الاتفاق.
ضوابط وشروط استخدام الخدمات:
يلتزم المستخدم بدفع الحقوق المالية لمنصة مشروك عند استخدامه لأي خدمة مدفوعة وذلك حسب التعليمات التي تظهر عند استخدامه للخدمة، ويلتزم بالدفع لمنصة مشروك في القنوات المالية الخاصة بها والتي توضحها التعليمات التي تظهر عند استخدام الخدمات المدفوعة.
يلتزم مستخدم موقع منصة مشروك بالضوابط الموضحة لكل خدمة سواء كانت مدفوعة أم مجانية، ويحق لمنصة مشروك تغييرها في أي وقت دون سابق إنذار، وتصبح هذه الشروط فعالة وملزمة لكافة العملاء مباشرة. لهذا، يقر العميل بالتزامه بالضوابط والشروط الحالية والمستقبلية وهي على سبيل المثال لا الحصر:
خدمة الطلبات العقارية:
يلتزم مقدم الطلب العقاري بدقة البيانات الخاصة بالطلب، وأنها دقيقة وصحيحة وليست وهمية، وأن الطلب العقاري جاد وليس لغرض الاستطلاع فقط، كما يلتزم بالتفاعل مع الإعلانات الواردة من مزودي الخدمات العقارية والاجابة عن استفساراتهم التي تمكنهم من تقديم الخدمة المناسبة، وتوضيح ما إذا كانت الإعلانات المقدمة مناسبة لطلبه أم لا، كما يقوم بتقييم مزودي الخدمات العقارية من ناحية جودة تواصلهم والبيانات المقدمة منهم.
بيانات مزود الخدمة العقارية:
يلتزم من يسجل كمزود خدمة عقارية سواء (وسيط – أو مالك –– أو مطور) بتقديم بيانات صحيحة ودقيقة حول اهتماماته العقارية وتخصصه الجغرافي ودقة بيانات التواصل معه.
بيانات الإعلانات العقارية:
يلتزم مزود الخدمات العقارية بالضوابط الإعلانات العقارية الصادرة عن الهيئة العامة للعقار بقرار رقم (٣/١٤/م/٢١) وتاريخ ١٢/١٠/١٤٤٢ وبتقديم بيانات دقيقة حول الوحدات والإعلانات العقارية المخول بتسويقها والتي تتناسب مع الطلبات العقارية، وفي حال تحقيق صفقة من خلال التطبيق فيلتزم بدفع عمولة مشروك حسب سياسة الدفع المتبعة اذا كان غير مشترك، كما يجب أن يحتوي العرض أو الإعلان على معلومات تخص وحدة عقارية واحد فقط، ويحق لمنصة مشروك عدم قبول أو حذف أي عرض أو إعلان يحتوي على بيانات، أو أسعار، أو مساحات أكثر من وحدة واحدة.
يلتزم العميل بكافة شروط الاستخدام، وفي حالة المخالفة يحق لمنصة مشروك حذف أي محتوى مخالف سواء كانت طلبات أو عروض عقارية أو أي محتوى آخر دون تحمل أي تعويضات مالية أو قانونية.
يحق لمنصة مشروك تغيير شروط إضافة الطلب العقاري أو إضافة عروض أو إعلانات عقارية على الموقع في أي وقت دون سابق إنذار، وتصبح هذه الشروط فعالة وملزمة لكافة العملاء مباشرة. لهذا، يقر العميل بالتزامه بالشروط الحالية والمستقبلية، ونذكر على سبيل المثال وليس الحصر شكل الطلب العقاري أو الإعلانات والإعلانات العقارية ومحتواها وكيفية عرضها ومدة نشرها.
يلتزم العميل بعدم وضع أي محتوى في الموقع يخالف الأدب أو القانون، كما يلتزم بأنه المسؤول قانونياً بشأن أي محتوى يتم وضعه على الموقع من صور وبيانات وأرقام وأسعار، وفي حالة مخالفة العميل للقوانين أو لحقوق ملكية شخص أو أي جهة يحق لمنصة مشروك حذف المحتوى المخالف بدون تعويض العميل.
في حالة وقوع أي خطا في نشر جزء او كل الطلب أو الإعلانات والإعلانات العقارية الخاصة بالعميل او حذف جزء منها عن طريق الخطأ، فيقدر حجم الضرر بقيمة تقديرية لا تزيد عن قيمة الخدمة الاجمالية إن كانت مدفوعة، ولا تكون إدارة مشروك مسؤولة عن اية اضرار اخرى قد تحدث للعميل من جراء هذا الخطأ.
 
ضوابط الإعلانات العقارية:
أولاً: يلتزم مزود الخدمات العقارية بتقديم إعلانات عقارية وفق ما جاء في ضوابط الإعلانات العقارية الصادرة عن الهيئة العامة للعقار ١٤٤٢/١٠/١٢هـ.
ثانياً: دون إخلال باختصاصات الجهات ذات العلاقة، واختصاص الهيئة العامة للإعلام المرئي والمسموع يجب الإلزام في الإعلان العقاري بما يلي:
1)  تحري الصدق والأمانة
2)  الابتعاد عن كل ما يسبب التباساً او تضليلاً للعموم.
3)  الالتزام بما يصدر به الدليل العام لضوابط المحتوى الإعلاني.
4)   الالتزام بما يصدر من الجهات المختصة بتنظيم المحتوى الأخلاقي والإعلامي بجميع وسائطه المعلوماتية (التقليدية والإلكترونية).
5)  الالتزام بالأسماء الرسمية من مدن وأحياء وشوارع وانواع للعقارات، ويجوز إضافة الأسماء المتعارف عليها إضافة لها.
6)  أن يحتوي على البيانات الآتية:
      النص على كونه إعلاناً.
      تحديد الغرض منه (بيع، إيجار، استثمار، وغيرها)
      تحديد نوع العقار.
      اسم المُعلِن وصفته (مالك، مفوض)
      رقم ترخيص المُعلِن إن كان مكتباً أو مسوقاً عقارياً أو حاصلاً على وثيقة عمل حر.
      موقع العقار على أن يحتوي – بحد أدنى- (المدينة – الحي – رقم المخطط إن وجد).
      وسيلة تواصل فعّالة مع المُعلِن.
      الإفصاح عن بيانات العقار وفق ما يلي:
-      مساحة العقار.
-      النزاعات القائمة بشأنه – إن وجدت –.
-      الرهن أو القيد الذي يمنع أو يحد من التصرف أو الانتفاع من العقار.
-      الحقوق والالتزامات على العقار غير الموثقة في وثيقة العقار.
-      الخدمات المتعلقة بالعقار.
-      المعلومات التي قد تؤثر في العقار سواء في خفض قيمته أو التأثير على قرار المستهدف بالإعلان، مثل الضمانات ومددها ومطابقة كود البناء السعودي والعمر للعقار القائم وغير ذلك.
     إن كان الإعلان عن مزاد عقاري يجب – إضافة إلى ما يصدر من الجهات ذات العلاقة – أن يتضمن رقم ترخيص المزاد ومكانه، وشروطه، والموعد المحدد لإقامته، ومدته الزمنية، والموعد النهائي – إن وجد – للتقدم للمزاد.
ثالثاً: أن يحتوي الإعلان العقاري في منصة مشروك – إضافة إلى ما ورد في البند (ثانياً) – على البيانات التالية:
1) وصف العقار بما يشمل نوعه، وعمره، ومحتوياته، وأي وصف مؤثر، مثل: عرض الشارع الواقع عليه، وواجهة العقار، وغيرها.
2)  حدود وأطوال العقار.
3)  ثمن العقار.
رابعاً: دون إخلال باختصاصات الجهات ذات العلاقة يُحظر تضمين الإعلان العقاري أياً مما يأتي: 
1)  مخالفة للتعليمات الإسلامية او للأنظمة والتعليمات في المملكة او للأعراف السائدة.
2)  خدشاً للحياء.
3)  انتهاكاً لحقوق الملكية الفكرية.
4)  التعرض بصورة سلبية للمنافسين أو منشآت القطاع الخاص أو غيرها.
5)  عباراتٍ أو إشارات يفهم منها التمييز ضد أحد أيا كان.
6)  صوراً أو بيانات أو موقعاً أو مناظير مضللة أو لا تخص العقار المُعلن عنه.
7)  شعار الهيئة أو اسمها أو أي من الجهات الحكومية الأخرى إلا بإذن مسبق منها.
خامساً: يُحظر نشر الإعلانات العقارية الوهمية لغرض جمع بيانات المتلقين أو العموم أو أي غرض آخر.
سادساً: يجب إزالة الإعلان العقاري خلال مدة لا تزيد على (يومين) من تاريخ تمام أو انتهاء الغرض منه.
سابعاً: تقوم الهيئة بالرقابة على الالتزام بأحكام هذه الضوابط وإحالة المخالفة للجهات المختصة لاتخاذ الإجراءات النظامية بشأنها.
ثامناً: الالتزام من المتعاملين في منصة مشروك بنظام التجارة الإلكترونية واللائحة التنفيذية للنظام.
تاسعاً: الالتزام من المتعاملين في منصة مشروك بنظام الوساطة العقارية واللائحة التنفيذية للنظام.

      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">البيانات:</h2>
      <p className="mb-2">
      كل البيانات التي قام المستخدم بإضافتها في الموقع متاحة للاستخدام الشخصي والخاص والتجاري للمستخدم، وتشمل على سبيل المثال لا الحصر، بيانات الطلب العقاري وبيانات الوحدات العقارية المعروضة، وبيانات مزودي الخدمات العقارية المسجلين في الموقع، وبيانات الإعلانات العقارية المروجة، والبيانات المرسلة عبر المحادثات الداخلية أو عبر قنوات الاتصال الأخرى التي تتحيها منصة مشروك.
      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">استخدام محتوى الموقع:</h2>
      <p className="mb-2">
      كل البيانات التي قام المستخدم بإضافتها في الموقع متاحة للاستخدام الشخصي والخاص والتجاري للمستخدم، وتشمل على سبيل المثال لا الحصر، بيانات الطلب العقاري وبيانات الوحدات العقارية المعروضة، وبيانات مزودي الخدمات العقارية المسجلين في الموقع، وبيانات الإعلانات العقارية المروجة، والبيانات المرسلة عبر المحادثات الداخلية أو عبر قنوات الاتصال الأخرى التي تتحيها منصة مشروك.
      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">ضوابط وشروط استخدام الخدمات:</h2>
      <p>
      يلتزم المستخدم بدفع الحقوق المالية لمنصة مشروك عند استخدامه لأي خدمة مدفوعة وذلك حسب التعليمات التي تظهر عند استخدامه للخدمة، ويلتزم بالدفع لمنصة مشروك في القنوات المالية الخاصة بها والتي توضحها التعليمات التي تظهر عند استخدام الخدمات المدفوعة.
يلتزم مستخدم موقع منصة مشروك بالضوابط الموضحة لكل خدمة سواء كانت مدفوعة أم مجانية، ويحق لمنصة مشروك تغييرها في أي وقت دون سابق إنذار، وتصبح هذه الشروط فعالة وملزمة لكافة العملاء مباشرة. لهذا، يقر العميل بالتزامه بالضوابط والشروط الحالية والمستقبلية وهي على سبيل المثال لا الحصر:

      </p>
      
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">خدمة الطلبات العقارية::</h2>
      <p>
      يلتزم مقدم الطلب العقاري بدقة البيانات الخاصة بالطلب، وأنها دقيقة وصحيحة وليست وهمية، وأن الطلب العقاري جاد وليس لغرض الاستطلاع فقط، كما يلتزم بالتفاعل مع الإعلانات الواردة من مزودي الخدمات العقارية والاجابة عن استفساراتهم التي تمكنهم من تقديم الخدمة المناسبة، وتوضيح ما إذا كانت الإعلانات المقدمة مناسبة لطلبه أم لا، كما يقوم بتقييم مزودي الخدمات العقارية من ناحية جودة تواصلهم والبيانات المقدمة منهم.
      </p>
      
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">بيانات مزود الخدمة العقارية:</h2>
      <p>
      يلتزم من يسجل كمزود خدمة عقارية سواء (وسيط – أو مالك –– أو مطور) بتقديم بيانات صحيحة ودقيقة حول اهتماماته العقارية وتخصصه الجغرافي ودقة بيانات التواصل معه.
      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">بيانات الإعلانات العقارية:</h2>
      <p>
      يلتزم مزود الخدمات العقارية بالضوابط الإعلانات العقارية الصادرة عن الهيئة العامة للعقار بقرار رقم (٣/١٤/م/٢١) وتاريخ ١٢/١٠/١٤٤٢ وبتقديم بيانات دقيقة حول الوحدات والإعلانات العقارية المخول بتسويقها والتي تتناسب مع الطلبات العقارية، وفي حال تحقيق صفقة من خلال التطبيق فيلتزم بدفع عمولة مشروك حسب سياسة الدفع المتبعة اذا كان غير مشترك، كما يجب أن يحتوي العرض أو الإعلان على معلومات تخص وحدة عقارية واحد فقط، ويحق لمنصة مشروك عدم قبول أو حذف أي عرض أو إعلان يحتوي على بيانات، أو أسعار، أو مساحات أكثر من وحدة واحدة.
يلتزم العميل بكافة شروط الاستخدام، وفي حالة المخالفة يحق لمنصة مشروك حذف أي محتوى مخالف سواء كانت طلبات أو عروض عقارية أو أي محتوى آخر دون تحمل أي تعويضات مالية أو قانونية.
يحق لمنصة مشروك تغيير شروط إضافة الطلب العقاري أو إضافة عروض أو إعلانات عقارية على الموقع في أي وقت دون سابق إنذار، وتصبح هذه الشروط فعالة وملزمة لكافة العملاء مباشرة. لهذا، يقر العميل بالتزامه بالشروط الحالية والمستقبلية، ونذكر على سبيل المثال وليس الحصر شكل الطلب العقاري أو الإعلانات والإعلانات العقارية ومحتواها وكيفية عرضها ومدة نشرها.
يلتزم العميل بعدم وضع أي محتوى في الموقع يخالف الأدب أو القانون، كما يلتزم بأنه المسؤول قانونياً بشأن أي محتوى يتم وضعه على الموقع من صور وبيانات وأرقام وأسعار، وفي حالة مخالفة العميل للقوانين أو لحقوق ملكية شخص أو أي جهة يحق لمنصة مشروك حذف المحتوى المخالف بدون تعويض العميل.
في حالة وقوع أي خطا في نشر جزء او كل الطلب أو الإعلانات والإعلانات العقارية الخاصة بالعميل او حذف جزء منها عن طريق الخطأ، فيقدر حجم الضرر بقيمة تقديرية لا تزيد عن قيمة الخدمة الاجمالية إن كانت مدفوعة، ولا تكون إدارة مشروك مسؤولة عن اية اضرار اخرى قد تحدث للعميل من جراء هذا الخطأ.
      </p>
    </section>
    <section className="mb-4">
      <h2 className="text-md font-semibold mb-2">ضوابط الإعلانات العقارية:</h2>
      <p>
      أولاً: يلتزم مزود الخدمات العقارية بتقديم إعلانات عقارية وفق ما جاء في ضوابط الإعلانات العقارية الصادرة عن الهيئة العامة للعقار ١٤٤٢/١٠/١٢هـ.
ثانياً: دون إخلال باختصاصات الجهات ذات العلاقة، واختصاص الهيئة العامة للإعلام المرئي والمسموع يجب الإلزام في الإعلان العقاري بما يلي:
1)  تحري الصدق والأمانة
2)  الابتعاد عن كل ما يسبب التباساً او تضليلاً للعموم.
3)  الالتزام بما يصدر به الدليل العام لضوابط المحتوى الإعلاني.
4)   الالتزام بما يصدر من الجهات المختصة بتنظيم المحتوى الأخلاقي والإعلامي بجميع وسائطه المعلوماتية (التقليدية والإلكترونية).
5)  الالتزام بالأسماء الرسمية من مدن وأحياء وشوارع وانواع للعقارات، ويجوز إضافة الأسماء المتعارف عليها إضافة لها.
6)  أن يحتوي على البيانات الآتية:
      النص على كونه إعلاناً.
      تحديد الغرض منه (بيع، إيجار، استثمار، وغيرها)
      تحديد نوع العقار.
      اسم المُعلِن وصفته (مالك، مفوض)
      رقم ترخيص المُعلِن إن كان مكتباً أو مسوقاً عقارياً أو حاصلاً على وثيقة عمل حر.
      موقع العقار على أن يحتوي – بحد أدنى- (المدينة – الحي – رقم المخطط إن وجد).
      وسيلة تواصل فعّالة مع المُعلِن.
      الإفصاح عن بيانات العقار وفق ما يلي:
-      مساحة العقار.
-      النزاعات القائمة بشأنه – إن وجدت –.
-      الرهن أو القيد الذي يمنع أو يحد من التصرف أو الانتفاع من العقار.
-      الحقوق والالتزامات على العقار غير الموثقة في وثيقة العقار.
-      الخدمات المتعلقة بالعقار.
-      المعلومات التي قد تؤثر في العقار سواء في خفض قيمته أو التأثير على قرار المستهدف بالإعلان، مثل الضمانات ومددها ومطابقة كود البناء السعودي والعمر للعقار القائم وغير ذلك.
     إن كان الإعلان عن مزاد عقاري يجب – إضافة إلى ما يصدر من الجهات ذات العلاقة – أن يتضمن رقم ترخيص المزاد ومكانه، وشروطه، والموعد المحدد لإقامته، ومدته الزمنية، والموعد النهائي – إن وجد – للتقدم للمزاد.
ثالثاً: أن يحتوي الإعلان العقاري في منصة مشروك – إضافة إلى ما ورد في البند (ثانياً) – على البيانات التالية:
1) وصف العقار بما يشمل نوعه، وعمره، ومحتوياته، وأي وصف مؤثر، مثل: عرض الشارع الواقع عليه، وواجهة العقار، وغيرها.
2)  حدود وأطوال العقار.
3)  ثمن العقار.
رابعاً: دون إخلال باختصاصات الجهات ذات العلاقة يُحظر تضمين الإعلان العقاري أياً مما يأتي: 
1)  مخالفة للتعليمات الإسلامية او للأنظمة والتعليمات في المملكة او للأعراف السائدة.
2)  خدشاً للحياء.
3)  انتهاكاً لحقوق الملكية الفكرية.
4)  التعرض بصورة سلبية للمنافسين أو منشآت القطاع الخاص أو غيرها.
5)  عباراتٍ أو إشارات يفهم منها التمييز ضد أحد أيا كان.
6)  صوراً أو بيانات أو موقعاً أو مناظير مضللة أو لا تخص العقار المُعلن عنه.
7)  شعار الهيئة أو اسمها أو أي من الجهات الحكومية الأخرى إلا بإذن مسبق منها.
خامساً: يُحظر نشر الإعلانات العقارية الوهمية لغرض جمع بيانات المتلقين أو العموم أو أي غرض آخر.
سادساً: يجب إزالة الإعلان العقاري خلال مدة لا تزيد على (يومين) من تاريخ تمام أو انتهاء الغرض منه.
سابعاً: تقوم الهيئة بالرقابة على الالتزام بأحكام هذه الضوابط وإحالة المخالفة للجهات المختصة لاتخاذ الإجراءات النظامية بشأنها.
ثامناً: الالتزام من المتعاملين في منصة مشروك بنظام التجارة الإلكترونية واللائحة التنفيذية للنظام.
تاسعاً: الالتزام من المتعاملين في منصة مشروك بنظام الوساطة العقارية واللائحة التنفيذية للنظام

      </p>
    </section>
        </div>
        </div>
    )
}
export default AboutPage